In [1]:
import pandas as pd
import numpy as np

In [6]:
data = {"Column1": [1,2,3,4,5],
       "Column2": [10,20,20,45,25],
       "Column3": ["abc","bca","ade","cba","dea"]}

In [7]:
df = pd.DataFrame(data)
df

   Column1  Column2 Column3
0        1       10     abc
1        2       20     bca
2        3       20     ade
3        4       45     cba
4        5       25     dea

In [8]:
df["Column1"].unique()
#burada tekrarlamayan bilgilerini getirdi.

array([1, 2, 3, 4, 5], dtype=int64)

In [10]:
df["Column2"].unique()
#bu sefer eleman sayısını 4 verdi çünkü 20 iki defa tekrar ettiği için tekilleştirdi.

array([10, 20, 45, 25], dtype=int64)

In [12]:
df["Column2"].nunique()
#kaç tekil bilgi var.

4

In [14]:
df["Column2"].value_counts()
#her bir değer kaç defa tekrar ediyor onu veriyor bize.

20    2
10    1
45    1
25    1
Name: Column2, dtype: int64

In [16]:
df["Column2"] * 2

0    20
1    40
2    40
3    90
4    50
Name: Column2, dtype: int64

In [17]:
def kareal(x):
    return x*x

In [19]:
df["Column1"].apply(kareal)
#Column1 içindeki değerlerin hepsi kareal fonksiyonuyla hesaplanıyor.

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [24]:
kareal2 = lambda x: x*x
#yukarıdaki aynı yöntemi lambda fonksiyonuyla da yapabiliriz.

In [25]:
df["Column1"].apply(kareal2)

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [26]:
df["Column1"].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [29]:
df["Column3"].apply(len)

0    3
1    3
2    3
3    3
4    3
Name: Column3, dtype: int64

In [30]:
df["Column4"] = df["Column3"].apply(len)

In [31]:
df

   Column1  Column2 Column3  Column4
0        1       10     abc        3
1        2       20     bca        3
2        3       20     ade        3
3        4       45     cba        3
4        5       25     dea        3

In [33]:
len(df.columns)

4

In [34]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
len(df.index)

5

In [36]:
df.info

<bound method DataFrame.info of    Column1  Column2 Column3  Column4
0        1       10     abc        3
1        2       20     bca        3
2        3       20     ade        3
3        4       45     cba        3
4        5       25     dea        3>

In [39]:
df.sort_values("Column2")
#küçükten büyüğe doğru sıraladık

   Column1  Column2 Column3  Column4
0        1       10     abc        3
1        2       20     bca        3
2        3       20     ade        3
4        5       25     dea        3
3        4       45     cba        3

In [40]:
df.sort_values("Column3")
#alfabetik sıraya göre sıraladık

   Column1  Column2 Column3  Column4
0        1       10     abc        3
2        3       20     ade        3
1        2       20     bca        3
3        4       45     cba        3
4        5       25     dea        3

In [42]:
df.sort_values("Column3",ascending = False)
# ascending = False bu yöntemle sıralamayı büyükten küçüğe doğru sıraladık.

   Column1  Column2 Column3  Column4
4        5       25     dea        3
3        4       45     cba        3
1        2       20     bca        3
2        3       20     ade        3
0        1       10     abc        3

In [43]:
data2 = {"Ay": ["Mayıs","Haziran","Nisan","Mayıs","Haziran","Nisan","Mayıs","Haziran","Nisan"],
        "Kategori": ["Elektronik","Elektronik","Elektronik","Kitap","Kitap","Kitap","Giyim","Giyim","Giyim"],
        "Gelir": [20,30,15,14,32,42,12,36,52]}

In [44]:
df = pd.DataFrame(data2)
df

        Ay    Kategori  Gelir
0    Mayıs  Elektronik     20
1  Haziran  Elektronik     30
2    Nisan  Elektronik     15
3    Mayıs       Kitap     14
4  Haziran       Kitap     32
5    Nisan       Kitap     42
6    Mayıs       Giyim     12
7  Haziran       Giyim     36
8    Nisan       Giyim     52

In [46]:
df.pivot_table(index="Ay", columns= "Kategori", values="Gelir")
#Ay değeri indeks olarak, Kategori değeri kolon olarak geldi bize.

Kategori  Elektronik  Giyim  Kitap
Ay
Haziran           30     36     32
Mayıs             20     12     14
Nisan             15     52     42